app/views/invites/_comment.html.erb

INSERT INTO "invite_comments" ("user_id", "invite_id", "created_at", "updated_at", "comment") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["invite_id", 10], ["created_at", "2020-04-20 05:36:13.259554"], ["updated_at", "2020-04-20 05:36:13.259554"], ["comment", "テスト"]]
---
		<span class="is-size-7"><%= link_to invite_comment.user.handle_name, user_path(invite_comment.user.id) %></span>
		<span class="is-size-7"><%= invite_comment.created_at.strftime('%Y/%m/%d') %></span>