app/views/invites/_mark.html.erb

	<i class="fas fa-star" aria-hidden="true" style="color: orange;"></i>
	<%= invite.marks.count %> 気になる
---
SELECT COUNT(*) FROM "marks" WHERE "marks"."invite_id" = ?  [["invite_id", 10]]

	<i class="far fa-star" aria-hidden="true" style="color: orange;"></i>
	<%= invite.marks.count %> 気になる
---
SELECT COUNT(*) FROM "marks" WHERE "marks"."invite_id" = ?  [["invite_id", 10]]