app/views/posts/_comment.html.erb

INSERT INTO "post_comments" ("user_id", "post_id", "created_at", "updated_at", "comment") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["post_id", 10], ["created_at", "2020-04-18 12:07:40.023044"], ["updated_at", "2020-04-18 12:07:40.023044"], ["comment", "テスト"]]
---
		<span class="is-size-7"><%= link_to post_comment.user.handle_name, user_path(post_comment.user.id) %></span>
		<span class="is-size-7"><%= post_comment.created_at.strftime('%Y/%m/%d') %></span>