app/views/posts/_favorite.html.erb

	<i class="fas fa-heart" aria-hidden="true" style="color: red;"></i>
	<%= post.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."post_id" = ?  [["post_id", 10]]

	<i class="far fa-heart" aria-hidden="true"  style="color: red;"></i>
	<%= post.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."post_id" = ?  [["post_id", 10]]