app/controllers/homes_controller.rb

SELECT  "invites".* FROM "invites" ORDER BY "invites"."created_at" DESC LIMIT ?  [["LIMIT", 4]]
---
  def top
    @invites = Invite.order(created_at: :desc).limit(4)