app/controllers/invites_controller.rb

  def index
    @q = Invite.ransack(params[:q])
    @invites = @q.result.page(params[:page]).reverse_order
---
SELECT  "invites".* FROM "invites" WHERE "invites"."type" = 10 ORDER BY "invites"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "invites"

  def show
    @invite = Invite.find(params[:id])
---
SELECT  "invites".* FROM "invites" WHERE "invites"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]

  def create
    @invite = Invite.new(invite_params)
    @invite.user_id = current_user.id
    @invite.save
---
INSERT INTO "invites" ("user_id", "image_id", "title", "content", "sex", "age", "created_at", "updated_at", "video") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @invite = Invite.find(params[:id])
---
SELECT  "invites".* FROM "invites" WHERE "invites"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]

  def update
    invite = Invite.find(params[:id])
    invite.update(invite_params)
---
SELECT  "invites".* FROM "invites" WHERE "invites"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]
UPDATE "invites" SET "content" = ?, "age" = ?, "image_id" = ?, "updated_at" = ? WHERE "invites"."id" = ?  [["content", "よしよし"], ["age", 2], ["image_id", "0b3ea71a4fca5ced019d0da92f409e5b270742d448ffaba42aa23641ddd4"], ["updated_at", "2020-04-27 11:52:29.928855"], ["id", 24]]

  def destroy
    invite = Invite.find(params[:id])
    invite.destroy
---
SELECT  "invites".* FROM "invites" WHERE "invites"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "invites" WHERE "invites"."id" = ?  [["id", 2]]