app/controllers/invite_comments_controller.rb

  def create
    @invite = Invite.find(params[:invite_id])
    @invite_comment = @invite.invite_comments.new(invite_comment_params)
    @invite_comment.user_id = current_user.id
    if @invite_comment.save
      flash.now[:success] = 'コメントしました。'
      @invite.create_notification_comment!(current_user, @invite_comment.id)
---
SELECT  "invites".* FROM "invites" WHERE "invites"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "invite_comments" ("user_id", "invite_id", "created_at", "updated_at", "comment") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["invite_id", 23], ["created_at", "2020-04-24 06:42:56.028215"], ["updated_at", "2020-04-24 06:42:56.028215"], ["comment", "大きい猫ちゃんですね！"]]
INSERT INTO "notifications" ("visitor_id", "visited_id", "invite_id", "invite_comment_id", "action", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
    @invite_comment = InviteComment.find(params[:invite_id])
    @invite = @invite_comment.invite
    @invite_comment.destroy
---
SELECT  "invite_comments".* FROM "invite_comments" WHERE "invite_comments"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "invite_comments" WHERE "invite_comments"."id" = ?  [["id", 3]]