app/controllers/marks_controller.rb

  def create
    @invite = Invite.find(params[:invite_id])
    mark = current_user.marks.new(invite_id: @invite.id)
    mark.save
    @invite.create_notification_favorite!(current_user)
---
SELECT  "invites".* FROM "invites" WHERE "invites"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
INSERT INTO "marks" ("user_id", "invite_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["invite_id", 23], ["created_at", "2020-04-24 06:42:32.087508"], ["updated_at", "2020-04-24 06:42:32.087508"]]
INSERT INTO "notifications" ("visitor_id", "visited_id", "invite_id", "action", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["visitor_id", 3], ["visited_id", 1], ["invite_id", 11], ["action", "mark"], ["created_at", "2020-04-22 10:57:06.881606"], ["updated_at", "2020-04-22 10:57:06.881606"]]

  def destroy
    @invite = Invite.find(params[:invite_id])
    mark = current_user.marks.find_by(invite_id: @invite.id)
    mark.destroy
---
SELECT  "invites".* FROM "invites" WHERE "invites"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
SELECT  "marks".* FROM "marks" WHERE "marks"."user_id" = ? AND "marks"."invite_id" = ? LIMIT ?  [["user_id", 3], ["invite_id", 21], ["LIMIT", 1]]
DELETE FROM "marks" WHERE "marks"."id" = ?  [["id", 3]]