app/controllers/notifications_controller.rb

  def index
    @notifications = current_user.passive_notifications.page(params[:page]).per(10)
    # checked:false=未確認をtrue=確認済に更新する
    @notifications.where(checked: false).each do |notification|
      notification.update(checked: true)
---
UPDATE "notifications" SET "checked" = ?, "updated_at" = ? WHERE "notifications"."id" = ?  [["checked", 1], ["updated_at", "2020-04-24 06:45:56.947660"], ["id", 8]]

  def destroy
    @notifications = current_user.passive_notifications.destroy_all
---
DELETE FROM "notifications" WHERE "notifications"."id" = ?  [["id", 11]]