app/controllers/posts_controller.rb

  def index
    @q = Post.ransack(params[:q])
    @posts = @q.result.page(params[:page]).reverse_order
---
SELECT  "posts".* FROM "posts" WHERE "posts"."type" = 9 ORDER BY "posts"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    @post.save
---
INSERT INTO "posts" ("user_id", "image_id", "title", "content", "sex", "age", "type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    post = Post.find(params[:id])
    post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "posts" SET "sex" = ?, "age" = ?, "type" = ?, "image_id" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["sex", 1], ["age", 3], ["type", 11], ["image_id", "e16f039c25e7ce5622642ae98bfd69a0bef0f66ad6b739226db94dd6d202"], ["updated_at", "2020-04-16 07:39:21.185853"], ["id", 10]]

  def destroy
    post = Post.find(params[:id])
    post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]