app/controllers/post_comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
INSERT INTO "post_comments" ("user_id", "post_id", "created_at", "updated_at", "comment") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["post_id", 23], ["created_at", "2020-04-24 06:43:54.163040"], ["updated_at", "2020-04-24 06:43:54.163040"], ["comment", "こちらもにっこり"]]
INSERT INTO "notifications" ("visitor_id", "visited_id", "post_id", "action", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["visitor_id", 1], ["visited_id", 2], ["post_id", 22], ["action", "post_comment"], ["created_at", "2020-04-25 09:55:09.352782"], ["updated_at", "2020-04-25 09:55:09.352782"]]
---
  def create
    @post = Post.find(params[:post_id])
    @post_comment = @post.post_comments.new(post_comment_params)
    @post_comment.user_id = current_user.id
    if @post_comment.save
      flash.now[:success] = 'コメントしました。'
      @post.create_notification_comment!(current_user, @post_comment.id)

SELECT  "post_comments".* FROM "post_comments" WHERE "post_comments"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
DELETE FROM "post_comments" WHERE "post_comments"."id" = ?  [["id", 11]]
---
  def destroy
    @post_comment = PostComment.find(params[:post_id])
    @post = @post_comment.post
    @post_comment.destroy