app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @invites = @user.invites.page(params[:page]).reverse_order
    @posts = @user.posts.page(params[:page]).reverse_order
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "invites".* FROM "invites" WHERE "invites"."user_id" = ? ORDER BY "invites"."id" DESC LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "invites" WHERE "invites"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    @user = User.find(params[:id])
    @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "profile" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile", "テストです。"], ["updated_at", "2020-05-10 08:56:09.101410"], ["id", 4]]