app/models/invite.rb

  def create_notification_favorite!(current_user)
    temp = Notification.where(['visitor_id = ? and visited_id = ? and invite_id = ? and action = ? ', current_user.id, user_id, id, 'mark'])
    # blank? = 一度も気になるされていない場合で気になるをされたら通知する
    if temp.blank?
      notification = current_user.active_notifications.new(
        invite_id: id,
        visited_id: user_id,
        action: 'mark'
      )
      # 自分が自分の投稿に気になるをした時は通知済の扱いをする
      if notification.visitor_id == notification.visited_id
        notification.checked = true
      end
      notification.save if notification.valid?
---
SELECT "notifications".* FROM "notifications" WHERE (visitor_id = 3 and visited_id = 1 and invite_id = 11 and action = 'mark' ) ORDER BY "notifications"."created_at" DESC
SELECT  1 AS one FROM "marks" WHERE "marks"."invite_id" = ? AND "marks"."user_id" = ? LIMIT ?  [["invite_id", 21], ["user_id", 1], ["LIMIT", 1]]
SELECT "notifications".* FROM "notifications" WHERE (visitor_id = 1 and visited_id = 3 and invite_id = 23 and action = 'mark' ) ORDER BY "notifications"."created_at" DESC
INSERT INTO "notifications" ("visitor_id", "visited_id", "invite_id", "action", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["visitor_id", 1], ["visited_id", 3], ["invite_id", 23], ["action", "mark"], ["created_at", "2020-04-24 06:42:32.113128"], ["updated_at", "2020-04-24 06:42:32.113128"]]

  def create_notification_comment!(current_user, invite_comment_id)
    # （ログイン中の会員と投稿者以外で）同じ投稿にコメントしているユーザーに通知を送る
    temp_ids = InviteComment.where(invite_id: id).where.not('user_id=? or user_id=?', current_user.id, user_id).select(:user_id).distinct
    # 取得したユーザーへの通知レコードを作成
    temp_ids.each do |temp_id|
---
SELECT DISTINCT "invite_comments"."user_id" FROM "invite_comments" WHERE "invite_comments"."invite_id" = ? AND NOT (user_id=3 or user_id=1)  [["invite_id", 11]]
SELECT DISTINCT "invite_comments"."user_id" FROM "invite_comments" WHERE "invite_comments"."invite_id" = ? AND NOT (user_id=1 or user_id=3)  [["invite_id", 23]]

  def save_notification_comment!(current_user, invite_comment_id, visited_id)
    notification = current_user.active_notifications.new(
      invite_id: id,
      invite_comment_id: invite_comment_id,
      visited_id: visited_id,
      action: 'invite_comment'
    )
    # 自分が自分の投稿にコメントした時は通知済の扱いをする
    if notification.visitor_id == notification.visited_id
      notification.checked = true
    end
    notification.save if notification.valid?
---
INSERT INTO "notifications" ("visitor_id", "visited_id", "invite_id", "invite_comment_id", "action", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)