app/models/post.rb

SELECT "notifications".* FROM "notifications" WHERE (visitor_id = 1 and visited_id = 3 and post_id = 23 and action = 'favorite' ) ORDER BY "notifications"."created_at" DESC
SELECT  1 AS one FROM "favorites" WHERE "favorites"."post_id" = ? AND "favorites"."user_id" = ? LIMIT ?  [["post_id", 23], ["user_id", 4], ["LIMIT", 1]]
INSERT INTO "notifications" ("visitor_id", "visited_id", "post_id", "action", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["visitor_id", 1], ["visited_id", 3], ["post_id", 23], ["action", "favorite"], ["created_at", "2020-04-24 06:43:42.948621"], ["updated_at", "2020-04-24 06:43:42.948621"]]
---
  def create_notification_favorite!(current_user)
    temp = Notification.where(['visitor_id = ? and visited_id = ? and post_id = ? and action = ? ', current_user.id, user_id, id, 'favorite'])
    # blank? = 一度もいいねされていない場合でいいねをされたら通知する
    if temp.blank?
      notification = current_user.active_notifications.new(
        post_id: id,
        visited_id: user_id,
        action: 'favorite'
      )
      # 自分が自分の投稿にいいねをした時は通知済の扱いをする
      if notification.visitor_id == notification.visited_id
        notification.checked = true
      end
      notification.save if notification.valid?

SELECT DISTINCT "post_comments"."user_id" FROM "post_comments" WHERE "post_comments"."post_id" = ? AND NOT (user_id=1 or user_id=3)  [["post_id", 23]]
SELECT DISTINCT "post_comments"."user_id" FROM "post_comments" WHERE "post_comments"."post_id" = ? AND NOT (user_id=4 or user_id=3)  [["post_id", 23]]
---
  def create_notification_comment!(current_user, post_comment_id)
    # （ログイン中の会員と投稿者以外で）同じ投稿にコメントしているユーザーに通知を送る
    temp_ids = PostComment.where(post_id: id).where.not('user_id=? or user_id=?', current_user.id, user_id).select(:user_id).distinct
    # 取得したユーザーへの通知を作成
    temp_ids.each do |temp_id|

INSERT INTO "notifications" ("visitor_id", "visited_id", "post_id", "post_comment_id", "action", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def save_notification_comment!(current_user, post_comment_id, visited_id)
    notification = current_user.active_notifications.new(
      post_id: id,
      post_comment_id: post_comment_id,
      visited_id: visited_id,
      action: 'post_comment'
    )
    # 自分が自分の投稿にコメントした時は通知済の扱いをする
    if notification.visitor_id == notification.visited_id
      notification.checked = true
    end
    notification.save if notification.valid?